// pages/index/newsDetil/newsDetil.js
Page({

  data: {
    //设置显示的新闻的内容
    newsTitle: 'kk',
    newsDate: '2018',
    author: 't',
    newsContent: '555',
    //新闻内容池
    newsScoket: [
      {
        newsTitle: '角钢的热处理技术',
        newsDate: '发布时间：2018-01-28',
        author: '丰泰集团新媒体部',
        newsContent: '在角钢在进行加工处理的时分，最重要的技能技能就是进行热处理技能，而且仍是有很多约束点的，关于角钢的这项技能来说仍是比较有难度，并不仅仅是进行加热就可以的。济南工字钢角钢小编为你解答，希望对您会有所帮助！角钢在加工处理的时分要进行热处理技能，这项热处理技能一般的温度要到达上百度，有的还可能到达上千度，常见的矿物油的闪点为：10号机械油为170℃，20号机械油为171℃，30号机械油为179℃，40号机械油为180℃，过热汽缸油hg- 52、62分别为300℃、315℃，组成汽缸油hg-65h、72h分别为325℃、340℃。一般来说，汽缸首要用于回火用油。这就要高功能的加工技能进行处理。角钢等模具钢材，一般在热处理过程中的淬火用油，多采用矿物油，如：10号、20号、30号等机械油，针对不同的模具零件，单个热处理企业运用0号柴油、7号机械油等。油的序号越高，黏度越大，闪点就越高。一般闪点在150～300℃之间。角钢热处理时油的闪点是指油外表的蒸气和空气天然混合时，与火相接触而呈现火苗的温度，它的温度的凹凸，对淬火零件的安全性有必定的影响。现在来看在铸造角钢的时分，每一个过程都是十分至关重要的，所以作为常用管，它的质量天然也是十分有保证的。'
      },
      {
        newsTitle: '声测管选型的基本方法',
        newsDate: '发布时间：2018-01-28',
        author: '丰泰集团新媒体部',
        newsContent: '未来声测管选型的基本方法未来声测管在现在生活中很常见，但是很多朋友对于未来声测管的选型问题不是很清楚，今天我们公司就为大家详细介绍一下未来声测管选型的基本方法。未来声测管选型的基本方法：1、连接形式：万向球头，连接板、单耳、单片、双耳。2、注意事项：行程必需在有效行程的基础上加一定的余量（10mm左右）以便在装置过程中有误差。3、规格型号：6/158/188/ 1910 / 2212 / 2712 / 28活塞杆直径/缸筒直径）4、技术要求：（1）未来声测管外型应光洁、平滑、无毛刺。（2）缸筒外表涂黑漆、涂层应均匀、不允许露底、起皱、气泡、剥落、无严重流挂现象。不允许存在可见裂纹、麻点、无磕碰、划伤等缺陷。（3）活塞杆为氧化处置白色杆。（4）未来声测管循环时不应有卡阻现象。（5）实际所需支撑力F1（6）工作环境：-40度～80度。（7）耐腐蚀试验按GB6458规定进行48小时。连接件不应有断裂或脱落现象。（8）抗拉强度≥8倍公称力拉伸. '
      },
      {
        newsTitle: '补库周期启动 螺纹钢有望迎来涨势?',
        newsDate: '发布时间：2018-01-27',
        author: '丰泰集团新媒体部',
        newsContent: '自去年12月以来，受年底资金面偏紧、下游需求走弱以及供给端压缩空间有限等多重因素影响，国内钢材市场走出一波明显的下跌行情。而原料端价格走势明显偏强，目前1805合约，螺矿比价回落至6.8，较年内高点下降17%。冬储时间或提前每年年底，受银行季末加年末考核双重因素影响，整个市场资金面均呈现紧张状态，这也是去年12月钢材价格整体下挫的原因之一。进入一季度后，这一状况将有所缓解。一方面，从季节性数据来看，不论是新增信贷还是社会融资总量，一般一季度均为全年高点。另一方面，进入1月后，1年期国债收益率出现了较为明显的下跌，且与10年期收益率差值扩大，表明市场预期中短期资金紧张局面有所缓解。自去年12月下旬以来，螺纹钢社会库存和钢厂库存持续回升，不过这主要是需求走弱下的被动增库存，贸易商并未开始入场冬储。考虑到投资者对今年钢市预期仍较为乐观，冬储行情的出现将是大概率事件。后期需要关注价格跌至什么水平时，贸易商才愿意进行冬储以及冬储可能开始的时间。根据卓创资讯年初的调研，华北地区贸易商进行冬储的心理价位普遍在3500—3700元/ 吨，华东地区贸易商的心理价位在3600—3800元/ 吨，也就是说，现货价格短期内仍有100—200元/ 吨的下跌空间。对于冬储启动的时间，考虑到今年春节较为滞后，冬储启动时间可能在1月下旬到2月初。不过，若短期内价格跌至贸易商心理价位，冬储时间也有可能提前。另外，从库存绝对量来看，尽管近几周库存有所增加，但无论是钢厂库存还是社会库存均处于同期低位。而且若社会库存增加至2017年2月高点，库存增幅需要翻倍，在目前环保限产的大背景下，出现这一情况的可能性并不大。同时，采暖季限产需要到3月中旬才能结束，而钢材需求预计春节后将会陆续启动。库存绝对量处于低位，叠加供需阶段性错配，可能会进一步推升春节前后的钢材价格。成本端存在支撑,尽管中长期来看铁矿石供大于求的矛盾依然较为明显，但一季度铁矿石价格走势存在一定的特殊性。一方面，从澳洲、巴西发货数据来看，一季度一般为全年低点。根据最新数据，1月第1周，澳洲、巴西矿石发货量环比减少444.7万吨。由于澳洲铁矿石发运港口近期将迎来飓风，因此后期发货量将继续回落。另一方面，目前钢厂进口矿库存天数处于22天的相对低位，而高炉开工率在12月中旬达到61.88% 的历史低位后出现了连续三周的反弹，表明市场对铁矿石需求回升，以及采暖季限产结束之后，钢厂复产和补库存存在预期。另外，我们看到，近期华东地区废钢价格已经达到2220元/吨，而我们计算的铁水成本目前在2100元/吨附近，也就是说，废钢价格相比铁水已经不具有经济性，若后期这一现象持续，将会形成铁水对废钢的反替代，这将进一步支撑铁矿石价格。因此，从一季度来看，铁矿石难以出现趋势性向下行情，振荡上行将成为铁矿石价格运行的主基调，而螺矿比价大概率以螺纹钢上涨方式修复。综合以上分析，在冬储需求叠加供需短期错配，以及成本支撑等因素影响下，后期螺纹钢继续下跌的可能性不大，且春节前后有望走出一波反弹行情，建议以逢低做多为主。'
      },
      {
        newsTitle: '本周型材价格全面走跌',
        newsDate: '发布时间：2018-01-27',
        author: '丰泰集团新媒体部',
        newsContent: '本周国内型材市场价格震荡下跌，跌势较前一周明显扩大。截止1月12日，25#工字钢市场经销均价4199.09元/吨，周环比跌幅1.66%；50*5角钢市场经销均价4153.64元/吨，周环比跌幅2.08%；20#槽钢市场经销均价4233.64元/吨，周环比跌幅1.23%；250*250H型钢市场经销均价4004.55元/吨，周环比跌幅1.32%。钢坯方面：截止1月12日，唐山本地钢厂及周边地区部分资源普碳方坯3550元/吨，现金含税，较上周同期下降80元/吨。另数据显示，1月12日唐山主要仓库及港口同口径统计钢坯库存39.5万吨，较上周增加8.2万吨，库存续增，对坯价明显利空。钢厂生产方面：1月11日统计唐山30家型钢厂50条生产线在产24条，开工率为48%。其中9条工字钢在产5条，15条槽钢在产9条，23条角钢在产8条，3条H型钢在产2条。钢厂库存方面：1月12日统计唐山27家型钢厂合计库存为43.15万吨，较上周相比上升4.14万吨，周环比上升10.61%。其中工字钢/H型钢总量为14.6万吨，周环比上升12.74%；槽钢总量为8.25万吨，周环比上升38.42%；角钢总量为20.3万吨，周环比上升1%。生意社型材分析师认为，本周成本端支撑弱，型材价格普遍下跌，加上关联期货走势难言乐观，现货市场交投谨慎，预计下周型材价格或继续趋弱，生意社型材指数或在1550-1620点之间。'
      },
      {
        newsTitle: '方管市场的出其不意着实让当下的所有',
        newsDate: '发布时间：2018-01-27',
        author: '丰泰集团新媒体部',
        newsContent: '这一轮下跌行情确实持续了较长时间——4年之久！1年秋季入学的大学新生如今已经本科毕业了，他们说工资、物价都涨好几次了，怎么钢材价格却不涨反跌，而且跌了N次，已从当初的每吨5000元左右跌至现在的每吨2000元左右？Q345B矩形管产业到底是往上走，还是往下走？的确，钢材价格往下走是摆在眼前的事实，业内人士众所周知；Q345B矩形管产量往上走大家也是有目共睹。只不过，我们Q345B矩形管产量的增长似乎已到尽头——今年以来粗钢产量连月下降，上半年产量同比下降1.3个百分点。这很正常，因为凡事总是有一个限度的。就如同人的身体长到一定高度就不会继续纵向增长了，而会横向增长，长粗、长结实，也就是在体质和体能上继续巩固和增强。同样的道理，我国Q345B矩形管产业现在已经不需要在产量上继续扩张，而需要在产品用途、产品质量、产品档次、技术水平、技术服务等方面得到扩充、增加和改善、提升。但是，产品价格走低，Q345B矩形管企业没有利润甚至亏损，这种生产经营显然是不可持续的。 '
      }
    ]
  },
  onLoad: function (options) {
    //获得新闻列表传参->newsid
    var newsId = options.id
    //根据newsId获取新闻池内的对应编号新闻
    var selectNews = this.data.newsScoket[newsId]
    //设置显示新闻内容的data，使得页面可以读取到对应新闻
    this.setData({
      newsTitle: selectNews.newsTitle,
      newsDate: selectNews.newsDate,
      author: selectNews.author,
      newsContent: selectNews.newsContent,
    })
  }
})